<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Battlelog Einträge nicht löschbar - Better Battlelog Forums #1623</title>
    <link rel="stylesheet" href="../stylesheets/page.css" type="text/css">
<script src="../scripts/p.js"></script>
</head>
<body class="forums-post left-side"><h2>Battlelog Eintr&auml;ge nicht l&ouml;schbar - Better Battlelog Forums #1623</h2><a href="sitemap.html">Sitemap</a>        <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-04-14T10:52:55+02:00">14. April 2012 10:52</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name">Guest</div></div>            </div>
            <div class="post-main">
                Browser: Mozilla/5.0 (Windows NT 6.0; WOW64; rv:11.0) Gecko/20100101 Firefox/11.0<br />
My BBLog Addon Version is: 1.5<br />
Hallo Roland,<br />
<br />
mir ist aufgefallen, dass ich Eintr&auml;ge mit BBlog leider nicht mehr l&ouml;schen kann. Bei dem Vorgang fragt er mich zwar, ob ich wirklich l&ouml;schen will und ich best&auml;tige auch mit YES aber er l&ouml;scht es nicht. Ich hab dann aufm 2. System auch mal Battlelog ohne BBlog aufgerufen und dort kann ich dann tats&auml;chlich wieder die Eintr&auml;ge l&ouml;schen. (falscher Index?)<br />
Achja, seit 2 Tagen hab ich 2mal die Centurion C-RAM in der Fahrzeugliste. <br />
<br />
Ansonsten is BBlog schon nen hammer Teil und mal wieder ein Beweis, dass von offizieller Seite immer nur halbe Sachen kommen *fg*.            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-04-14T11:01:24+02:00">14. April 2012 11:01</time>                                <div class="user-info"><div class="user-name admin">BrainFooLong</div><div class="user-role">Administrator</div></div>            </div>
            <div class="post-main">
                Ich frage mich gerade um was es geht :-)<br />
Bitte mehr Infos.            </div>
        </div>
                <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-04-14T11:09:58+02:00">14. April 2012 11:09</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name">Guest</div></div>            </div>
            <div class="post-main">
                Hm ok, ich versuchs mal anders *g*<br />
<br />
Du kannst doch die Eintr&auml;ge im Battlelog (Kommentare, Erungenschaften usw.) entweder melden mit dem kleinen gelben Achtung Symbol oben rechts in der Ecke eines jeden Eintrags oder, wenn der Eintrag von &acute;mir&acute;selbst ist auch mit dem kleinen Kreuz l&ouml;schen. Und wenn ich eigene Eintr&auml;ge l&ouml;schen will, auf das Kreuzlein dr&uuml;cke, dann kommt auch die Frage ob ich l&ouml;schen m&ouml;chte und ich best&auml;tige mit YES. Wenn dann nach dieser Aktion der Eintrag auch weg w&auml;re, w&auml;r ja gut :) aber es passiert gar nichts und alles ist so wie vorher. Wenn n&ouml;tig mach ich auch paar Screenshots, aber erstma schaun ob ich mich jetz gut genug ausgedr&uuml;ckt habe hrhr.<br />
Macht mir ja schon Sorgen, dass es sonst noch keinem aufgefallen is....            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-04-14T11:42:00+02:00">14. April 2012 11:42</time>                                <div class="user-info"><div class="user-name admin">BrainFooLong</div><div class="user-role">Administrator</div></div>            </div>
            <div class="post-main">
                Ok. Nun wei&szlig; ich was du meinst.<br />
Ich habe dieses Problem aber auf keiner Seite, weder mit noch ohne BBLog.<br />
Auch bezweifle ich das es an BBLog liegen k&ouml;nnte da bei diesen Aktionen BBLog gar nicht eingreift oder etwas ver&auml;ndert. Auch bist du der erste der so ein Problem &uuml;berhaupt meldet bzw. in Zusammenhang mit BBLog bringt.<br />
Irgendwie hab ich auch keine Tipps im Moment.<br />
Vielleicht addest mich mal im Battlelog, dann k&ouml;ma weiter schauen <div class="inline post-url">http://battlelog.battlefield.com/bf3/de/user/DJ-Brainnrg/</div><br />
Das mit dem Centurion C-RAM ist bekannt, wird mit dem n&auml;chsten Update gefixt.            </div>
        </div>
                <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-04-14T14:57:50+02:00">14. April 2012 14:57</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name">Guest</div></div>            </div>
            <div class="post-main">
                ja, das meinte ich damit, dass mir das Sorgen macht, weils sont noch keinem aufgefallen ist. Also wohl kein BBlog Problem. Ich werd mal paar Sachen durchprobieren, jetz wo ich wieder nen Schritt weiter bin, hab ich wieder paar Ideen. Mal den Sonntag anpeilen daf&uuml;r ;) Danke auf jeden f&uuml;r die Info!<br />
Ich adde Dich ma, dann kann ich damit prollen das ich DICH in der Liste habe LOL. Oh man ich hab wiedern nen Kasper gefr&uuml;hst&uuml;ckt heute....            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-04-14T15:22:32+02:00">14. April 2012 15:22</time>                                <div class="user-info"><div class="user-name admin">BrainFooLong</div><div class="user-role">Administrator</div></div>            </div>
            <div class="post-main">
                Lol. Also, falls du noch Problem hast, einfach in Battlelog anschreiben.<br />
Ich schlie&szlig;e das hier mal.<br />
Greetz            </div>
        </div>
        <script src="../scripts/t.js"></script></body></html>