<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>French translation - Better Battlelog Forums #1760</title>
    <link rel="stylesheet" href="../stylesheets/page.css" type="text/css">
<script src="../scripts/p.js"></script>
</head>
<body class="forums-post left-side"><h2>French translation - Better Battlelog Forums #1760</h2><a href="sitemap.html">Sitemap</a>        <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-06-08T01:35:33+02:00">08. June 2012 01:35</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name ">RedBubble</div></div>            </div>
            <div class="post-main">
                (FAQ)<br />
part one<br />
complete translation <br />
and fixing some errors<br />
-----------------------<br />
<br />
<div class="tag tag-b">FAQ - questions fr&eacute;quemment pos&eacute;es</div><br />
<br />
<div class="tag tag-b">BBLog est approuv&eacute; par DICE / Battlelog?</div><br />
Oui. JBRipley (membre de DICE) a partag&eacute; l&#039;extension avec d&#039;autres membres de DICE. <br />
Citation : <br />
<blockquote>&quot;Great work on your extension, it&#039;s really interesting for us at DICE to see what people add by themselves.&quot;</blockquote><br />
Traduction :<br />
<blockquote>&quot;Vous avez fait un excellent travail avec ce module, c&#039;est vraiment int&eacute;ressant pour nous, chez DICE, de voir ce que les joueurs sont capables d&#039;ajouter (au battlelog)&quot; </blockquote><br />
<div class="tag tag-u">Voir message</div><br />
<div class="tag tag-b"><br />
Comment &ccedil;a marche et qu&#039;est-ce que je dois faire?</div><br />
Depuis la version 0.93 le module supporte les mises &agrave; jour automatiques .<br />
Bien s&ucirc;r, vous pouvez la mettre &agrave; jour manuellement, en utilisant les t&eacute;l&eacute;chargements disponibles sur le site, dans le cas o&ugrave; vous auriez des probl&egrave;mes avec les mises &agrave; jour automatis&eacute;es.<br />
<br />
<div class="tag tag-b">Pas de support sur Mozilla AMO (catalogue d&#039;extensions et de modules)</div><br />
Apr&egrave;s quelques mois, nous avons enlev&eacute; notre module du site Mozilla car les d&eacute;lais d&#039;&eacute;valuation sont trop longs. Il faut attendre plus de dix jours pour que les derni&egrave;res versions soient publi&eacute;es sur AMO. Nos utilisateurs ne devrait pas attendre aussi longtemps : maintenant le module automatise les mises &agrave; jour, plus rapidement et avec le m&ecirc;me niveau de s&eacute;curit&eacute; qu&#039;AMO. Si vous avez t&eacute;l&eacute;charg&eacute; BBlog sur le site Mozilla, vous devez installer la derni&egrave;re version&agrave; partir de notre site afin que les mises &agrave; jour s&#039;effectuent toutes seules.<br />
<br />
<div class="tag tag-b">BBLog ne fonctionne pas avec Firefox, l&#039;icone n&#039;est pas visible.</div><br />
Certains utilisateurs nous ont signal&eacute; qu&#039;il ne voyait pas les fonctions de BBlog dans leur navigateur. Le probl&egrave;me provient d&#039;un profil Mozilla bugg&eacute;, ce qui arrive parfois avec Firefox pour des raisons inconnues et BBlog n&#039;est pas la cause de ces probl&egrave;mes, qui surviennent esentiellement avec des profils anciens. La solution consiste cr&eacute;er un nouveau profil :  Recherchez sur Google un tutoriel pour &quot;Firefox Profile Manager&quot;. <br />
<br />
<div class="tag tag-b">Est-ce qu&#039;il y a des probl&egrave;mes avec Punkbuster?</div><br />
non &agrave; 100%, PunkBuster n&#039;a rien &agrave; avoir avec Battlelog. Punkbuster ne s&#039;occupe que du game.exe! Vous ne serez pas &ecirc;tre expuls&eacute; ou banni &agrave; cause de BBlog.<br />
<br />
<div class="tag tag-b">Compatibilit&eacute; avec les autres addons</div><br />
Certains modules bloquent les scripts. S&#039;il y a des probl&egrave;mes, essayez d&#039;ajouter &quot;getbblog.com&quot; et &quot;battlelog.battlefield.com&quot; en liste blanche.<br />
On a signal&eacute; des probl&egrave;mes avec NoScript.            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-06-08T03:30:48+02:00">08. June 2012 03:30</time>                                <div class="user-info"><div class="user-name mod">Jos&eacute; Ortega</div><div class="user-role">Global Moderator</div></div>            </div>
            <div class="post-main">
                This is for the non-translated lines on the French Faq, isnt it?            </div>
        </div>
                <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-06-09T00:54:34+02:00">09. June 2012 00:54</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name ">RedBubble</div></div>            </div>
            <div class="post-main">
                I forgot to underline the changes, sorry.<br />
I noticed some mistakes and translated the remaining english lines.<br />
Do you use *.po files or similar stuff ? Could be more easy.<br />
<br />
If you agree I could rewrite some parts (some of them look like google translation)<br />
My english grammar is quite poor, but I&#039;m teaching french (and ofc it&#039;s my native language)            </div>
        </div>
                <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-06-10T03:04:45+02:00">10. June 2012 03:04</time>                <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name ">RedBubble</div></div>            </div>
            <div class="post-main">
                about this text (plot info):<br />
<br />
english version :<br />
<div class="tag tag-b">The plot show you the bullet spread for a weapon depending on your choosen attachment, position, zoomed/unzoomed and movement. You see a simulation of hundreds of burst-shots with 4 bullets at each burst. For single shot weapons only this is a fictive simulation just for visual clarification. Also when you change your plot setting the weapon spread/recoil information is updated.</div><br />
<br />
fornow the translation means nothing :<br />
<div class="tag tag-i">L&#039;intrigue est g&eacute;n&eacute;r&eacute; en simulant des &eacute;clats d&#039;arme avec les donn&eacute;es du c&ocirc;t&eacute; gauche. La parcelle doit &ecirc;tre utilis&eacute; uniquement comme un gimmick optique pour &eacute;cran pour vous l&#039;exactitude des donn&eacute;es plus visuellement. Un seul coup n&#039;est pas repr&eacute;sent&eacute; car la pr&eacute;cision varie pour chaque joueur (temps entre chaque tir). Pour les armes &agrave; tir unique, ce n&#039;est une simulation fictive juste pour clarification. Parcelles sur symthic.com diff&egrave;rent des parcelles bblog, mais chaque parcelle pr&eacute;sente les m&ecirc;mes informations exploitables - Combien les spreads arme.</div><br />
by example, in french, intrigue (plot in english version), means &quot;backstage manoeuvring&quot;, parcelle means &quot;landing plot&quot; ... the text is gibberish.<br />
<br />
my proposition :<br />
<br />
<div class="tag tag-b">La repr&eacute;sentation graphique montre la dispersion des balles, en fonction des accessoires, de la position (debout/accroupi/couch&eacute;), du mode de vis&eacute;e (&agrave; la hanche ou avec le viseur), tir en d&eacute;placement ou immobile. Vous pouvez voir une simulation d&#039;une centaine de rafales de 4 balles. Concernant les armes tirant coup par coup, ce n&#039;est qu&#039;une simulation, vous permettant d&#039;avoir un aper&ccedil;u du comportement de l&#039;arme. Quand vous modifier les param&egrave;tres, les donn&eacute;es du recul et de la dispersion sont mises &agrave; jour.</div>            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-06-10T03:11:33+02:00">10. June 2012 03:11</time>                                <div class="user-info"><div class="user-name admin">BrainFooLong</div><div class="user-role">Administrator</div></div>            </div>
            <div class="post-main">
                Hopefully this stuff is readed by our french translator.<br />
If you want you can contact me via PM if you want access to our translation tool.            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-06-14T12:35:36+02:00">14. June 2012 12:35</time>                                <div class="user-info"><div class="user-name mod">ORFK</div><div class="user-role">Global Moderator</div></div>            </div>
            <div class="post-main">
                Misstakes:<br />
<div class="inline post-url">http://www.noelshack.com/2012-24-1339669495-BBmistake2.png</div><br />
right word is &quot;fen&ecirc;tre&quot;<br />
<br />
and below it&#039;s not &icirc;cone but ic&ocirc;ne            </div>
        </div>
        <script src="../scripts/t.js"></script></body></html>