<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>About Portuguese Localization (Sobre a Localização PT) - Better Battlelog Forums #2008</title>
    <link rel="stylesheet" href="../stylesheets/page.css" type="text/css">
<script src="../scripts/p.js"></script>
</head>
<body class="forums-post left-side"><h2>About Portuguese Localization (Sobre a Localiza&ccedil;&atilde;o PT) - Better Battlelog Forums #2008</h2><a href="sitemap.html">Sitemap</a>        <div class="forums-post-single topic-starter">
            <div class="post-head">
                <time datetime="2012-09-06T03:46:20+02:00">06. September 2012 03:46</time>                    <div class="post-edited">Post edited 1                        x times, last by <div class="user-info"><div class="user-name admin">BrainFooLong</div><div class="user-role">Administrator</div></div> <time datetime="2012-11-20T20:37:34+01:00">20. November 2012 20:37</time></div>
                                    <div class="starter">Topicstarter</div>                <div class="user-info"><div class="user-name mod">Nano</div><div class="user-role">Global Moderator</div></div>            </div>
            <div class="post-main">
                <div class="tag tag-b">EN-US (for Portguese version, see below)</div><br />
<br />
I see some people using our new tool. It&#039;s awesome!<br />
But i&#039;ll set my position about this localization here, for your information.<br />
<br />
I know that in BBLog shows Portuguese (same flag for two distincts portugueses). And i know too there are multiple users from Portugal. But, in the beginning the ideia was to translate/localize BBLog to Brazilian Portuguese. And i&#039;m Brazilian. :P<br />
<br />
It&#039;s like having American English and British English and only a translation. So, for the points mentioned above, the choosen is Brazilian Portuguese.<br />
<br />
But don&#039;t get crazy!<br />
I try to the max not using regional words and follow the <div class="inline post-url">http://pt.wikipedia.org/wiki/Acordo_Ortogr%C3%A1fico_de_1990</div> (http://en.wikipedia.org/wiki/Portuguese_Language_Orthographic_Agreement_of_1990).<br />
Some words i preferred to leave in PT-BR, like &quot;About/Sobre/Acerca&quot;, &quot;File/Arquivo/Ficheiro&quot; (EN-US/PT-BR/PT-PT), for example. And some other words, relative a tools from original Battlelog, i decide to use the original, to avoid confusion.<br />
<br />
Back to Translation Tool: i&#039;ll read all sugestions and will edit some words which don&#039;t corresponding to PT-BR words.<br />
<br />
Almost 95% of BBLog plugin already translated. If you want to translate some old news, feel free. I&#039;ll read all suggestions on the weekends.<br />
<br />
And for the last, but not least: Obvious, nobody is perfect and if you have any better sugestion for any term, you still can send your sugestion to our tool or post in forums.<br />
<br />
Any criticism, suggestion or anything else about this localization, you can post here (only in english!) or send me a PM.<br />
<br />
:)<br />
<br />
------<br />
<div class="tag tag-b">PT-BR (for English version, see above)</div><br />
<br />
Eu vi muitas pessoas usando nossa ferramenta. Isso &eacute; impressionante!<br />
Mas eu deixarei aqui minha posi&ccedil;&atilde;o sobre esta localiza&ccedil;&atilde;o, para sua informa&ccedil;&atilde;o.<br />
<br />
Eu sei que no BBLog mostra a op&ccedil;&atilde;o de Portugues (mesma bandeira para dois portugueses distintos). E eu sei que h&aacute; v&aacute;rios usu&aacute;rios de Portugal. Mas, no come&ccedil;o, a ideia era de traduzir/localizar o BBLog para o Portugu&ecirc;s Brasileiro. E, al&eacute;m do mais, eu sou Brasileiro. :P<br />
<br />
&Eacute; como ter Ingl&ecirc;s Americano e Ingl&ecirc;s brit&acirc;nico, mas s&oacute; uma localiza&ccedil;&atilde;o. Ent&atilde;o, pelos pontos mencionados acima, o escolhido foi o Portugu&ecirc;s Brasileiro.<br />
<br />
Mas n&atilde;o fiquem loucos!<br />
Eu tento ao m&aacute;ximo n&atilde;o usar regionalismos e seguir o <div class="inline post-url">http://pt.wikipedia.org/wiki/Acordo_Ortogr%C3%A1fico_de_1990</div>.<br />
Algumas palavras eu preferi deixar em Portugu&ecirc;s Brasileiro, tal como &quot;About/Sobre/Acerca&quot;, &quot;File/Arquivo/Ficheiro&quot; (EN-US/PT-BR/PT-PT), por exemplo. E v&aacute;rias outras palavras, relativas a ferramentas originais do Battlelog, eu decidi usar as originais, para evitar confus&atilde;o.<br />
<br />
Voltando a Ferramenta de Tradu&ccedil;&atilde;o: Eu lerei todas as sugest&otilde;es e editarei as palavras que n&atilde;o corresponderem ao idioma Brasileiro.<br />
<br />
Quase 95% do BBLog j&aacute; est&aacute; traduzido. Se voc&ecirc; desejar traduzir as &quot;Novidades&quot; antigas, sinta-se livre. Lerei as sugest&otilde;es nos fins de semana.<br />
<br />
E, por &uacute;ltimo, mas n&atilde;o t&atilde;o menos importante: Obviamente, ningu&eacute;m &eacute; perfeito. E se voc&ecirc; tiver alguma sugest&atilde;o melhor para qualquer termo, voc&ecirc; ainda pode envia-la usando nossa ferramenta ou postar em nosso f&oacute;rum.<br />
<br />
Qualquer cr&iacute;tica, sugest&atilde;o ou qualquer outra coisa sobre esta localiza&ccedil;&atilde;o, voc&ecirc; pode postar aqui (somente em ingl&ecirc;s!) ou me mandar uma MP.<br />
<br />
:)            </div>
        </div>
                <div class="forums-post-single ">
            <div class="post-head">
                <time datetime="2012-12-12T08:23:59+01:00">12. December 2012 08:23</time>                                <div class="user-info"><div class="user-name ">WolfskinLux</div></div>            </div>
            <div class="post-main">
                if you need some help to the Portuguese of Portugal... I&#039;m here :)            </div>
        </div>
        <script src="../scripts/t.js"></script></body></html>